package task12_1_1;

public class Task12_1_1 {
    public static void main(String[] args) {
        System.out.println("""
            Задание:\s
            Модуль 12. Базы данных и Git. Задание №1:\s
            Цель задания: формирование базового представления о Docker и его предназначении\s
                Задание:
                1. Что такое Docker?
                2. Для чего он используется?
                3. Есть и  у него альтернативы?
            \s""");

        System.out.println("""
            Ответ на вопрос 1, Что такое Docker?:
                Docker - это программное обеспечение, которое позволяет вам упаковывать, доставлять и запускать
                приложения в контейнеризированной среде. Контейнеры позволяют упаковать приложение и все его
                зависимости в единую среду (контейнер), где оно может запускаться в изолированном и независимом от
                окружения образе.\s
            
                К примеру, Docker позволяет вам создать контейнер, который содержит ваше приложение, библиотеки,
                зависимости и всё необходимое для его работы. Этот контейнер может быть запущен на любой машине,
                где установлен Docker, без необходимости повторного конфигурирования и установки зависимостей по
                каждому компьютеру или серверу.
            
                Docker существенно упрощает разработку и развертывание приложений, улучшает их портируемость и
                обеспечивает консистентность окружений. Docker также позволяет масштабировать приложения быстро
                и эффективно, что делает его широко используемым в различных сценариях разработки программного
                обеспечения и развертывания приложений.
            \s""");

        System.out.println("""
            Примеры:\s
            \s""");
    }
}