package task11_9_0;

public class Task11_9_0 {
    public static void main(String[] args) {
        System.out.println("""
            Задание:\s
            Модуль 11. Протокол “HTTP”. Задание №9, Проект:\s
            Цель задания: совершенствование  навыков работы с протоколом HTTP\s
                Задание:
                1. В ранее созданном проекте, в папке main  создайте New Package c названием models, далее
                   класс Receiver
                2. В созданный класс Receiver вставляем  соответствующий код класса  из папки target из ранее
                   созданного проекта
                3. В ранее созданном Package под названием models создаем класс с названием InRadiusDto, далее
                   копируем в него соответствующий код класса из папки target проекта созданного на предыдущих уроках
            \s""");

        System.out.println("""
            Решение по заданию 8, Реализуйте циклическую загрузку данных при вводе значения latitude и longitude:
            \s""");

        System.out.println("""
            Примеры получения ответов на запросы с использованием протокола 'HTTP':\s
            \s""");
    }
}