package task11_2_1;

// В этом фрагменте, Draft_Module11_Task2_Zadaniya1-3,

public class Task11_2_1 {
    public static void main(String[] args) {
        System.out.println("""
                Задание:\s
                Модуль 11. Протокол “HTTP”. Задание №2:\s
                Цель задания: получить базовое представление о заголовках в   HTTP\s
                    Задание:
                    1. Ознакомьтесь с информацией о заголовках HTTP https://developer.mozilla.org/ru/docs/Web/HTTP/Headers
                    2. О каких видах заголовках в HTTP   вы узнали?
                    3. Расскажите о различиях HTTP  и  HTTPS?
                
                Решение:\s""");

        System.out.println("""
                Ответ на вопрос 1, Расскажите, как вы поняли, что такое HTTP?:
                  HTTP (англ. HyperText Transfer Protocol — «протокол передачи гипертекста») — широко
                  распространенный протокол передачи данных, изначально предназначенный для передачи
                  гипертекстовых документов (то есть документов, которые могут содержать ссылки,
                  позволяющие организовать переход к другим документам).
                  Также HTTP - это некий программный механизм, который обеспечивает взаимодействие фронтенда и
                  бэкэнда. Существует 'разновидность' HTTP - это HTTPS, в нём добавлена буква 'S' - 'secure', это
                  означает, что передача данных по этому протоколу зашифровывается.
                
                  \s""");
    }
}