package task11_1_1;

// В этом фрагменте, Draft_Module11_Task1_Zadaniya1-5, приступил к Модулю 11

public class Task11_1_1 {
    public static void main(String[] args) {
        System.out.println("""
                Задание:\s
                Модуль 11. Протокол “HTTP”. Задание №1:\s
                    1. Расскажите, как вы поняли, что такое HTTP?
                    2. Какие возможные сценарии использования протокола HTTP?
                    3. Опишите методы  HTTP
                    4. Что такое URL?
                    5. Какие еще сетевые протоколы вам известны?

                Решение:\s""");


        System.out.println("""
                Ответ на вопрос 1, Расскажите, как вы поняли, что такое HTTP?:
                  HTTP (англ. HyperText Transfer Protocol — «протокол передачи гипертекста») — широко
                  распространенный протокол передачи данных, изначально предназначенный для передачи
                  гипертекстовых документов (то есть документов, которые могут содержать ссылки,
                  позволяющие организовать переход к другим документам)
                  Решение:\s""");



    }
}