package task12_2_0;

public class Task12_2_0 {
    public static void main(String[] args) {
        System.out.println("""
            Задание:\s
            Модуль 12. Базы данных и Git. Задание №1:\s
            Цель задания: формирование базового представления о Docker и его предназначении\s
                Задание:
                1. Что такое Docker?
                2. Для чего он используется?
                3. Есть и  у него альтернативы?
            \s""");

        System.out.println("""
            Ответ на вопрос 1, Что такое Docker?:
            \s""");

        System.out.println("""
            Примеры:\s
            \s""");
    }
}