package task12_3_1.zadanye1;

import java.sql.*;

public class Zadanye1 {
    public static void main(String[] args) {
        System.out.println("""
            Задание:\s
            Модуль 12. Базы данных и Git. Задание №3:\s
            Цель задания: знакомство и формирование базовых навыков с по работе  с MySQL\s
                Задание:
                1. Что такое PostgreSQL?

                Решение:
            \s""");

        System.out.println("""
            PostgreSQL - это мощная объектно-реляционная система управления базами данных (СУБД),
            которая является одной из самых популярных и распространенных открытых баз данных.
            Она предлагает широкий набор функций, таких как поддержка SQL-запросов, транзакций,
            хранимых процедур, триггеров, репликации и многих других возможностей. PostgreSQL
            поддерживает множество операционных систем и является надежным и стабильным выбором
            для разработки больших и сложных баз данных.\s""");
    }
}
