package task12_3_1.zadanye1;

import java.sql.*;

public class Zadanye1 {
    public static void main(String[] args) {
        System.out.println("""
            Задание:\s
            Модуль 12. Базы данных и Git. Задание №3:\s
            Цель задания: знакомство и формирование базовых навыков с по работе  с MySQL\s
                Задание:
                1. Что такое MySQL?
            
                Решение:
            \s""");

        System.out.println("""
            MySQL: Программное обеспечение MySQL обеспечивает очень быстрый, многопоточный,
            многопользовательский сервер базы данных. Сервер MySQL предназначен для критически
            важных систем производства с высокой нагрузкой, а также для внедрения в массово
            распространенное программное обеспечение.
            \s""");
    }
}
