package task11_7_1;

public class Task11_7_1 {
    public static void main(String[] args) {
        System.out.println("""
                Задание:\s
                Модуль 11. Протокол “HTTP”. Задание №7:\s
                Цель задания: знакомство с Retrofit и его возможностями\s
                    Задание:
                    1. Что такое Retrofit?
                    2. Приведите сценарий его  использования?
                
                Решение:\s""");

        System.out.println("""
                Ответ на вопрос 1, Что такое Retrofit?:
                  Apache в контексте протокола HTTP — это веб-сервер, официально известный как Apache HTTP Server.
                
                Примеры использования "Apache HTTP" с использованием запросов GET и POST:
                \s""");

    }
}
