package task12_3_1.zadanye0;

import java.sql.*;

public class Connect {
//    private Connection connect() {
//    }

    public void update() {
    }

    public static void main(String[] args) {
        System.out.println("""
            Задание:\s
            Модуль 12. Базы данных и Git. Задание №3:\s
            Цель задания: знакомство и формирование базовых навыков с по работе  с SQLite\s
                Задание:
                1. Что такое MySQL?
                2. Напишите запрос, чтобы отобразить имя и фамилию всех сотрудников, в именах которых есть «b» и «c»
                   (Пример таблицы  см. таблица 2)
                3. Напишите запрос, чтобы отобразить имя (имя, фамилия) и дату приема на работу для всех сотрудников,
                   которые были приняты на работу в 1987 году. (Пример таблицы  см. таблица 2)
                4. Напишите запрос, чтобы получить максимальную и минимальную зарплату из таблицы сотрудников
                   (Пример таблицы  см. таблица 4)
                5. Напишите запрос, чтобы получить четные записи из таблицы сотрудников  (Пример таблицы
                   см. таблица 2)
                6. Напишите запрос, чтобы получить нечетные записи из таблицы сотрудников  (Пример таблицы
                   см. таблица 2)
            
                Решение:
            \s""");

    }
}
