package task11_5_1;

// В этом фрагменте, Draft_Module11_Task5_Zadaniya1-3,

public class Task11_5_1 {
    public static void main(String[] args) {
        System.out.println("""
                Задание:\s
                Модуль 11. Протокол “HTTP”. Задание №5:\s
                Цель задания: сформировать базовое представление о сериализации и десериализации в протоколе HTTP
                    Задание:
                    1. Что такое сериализации в контексте протокола HTTP?
                    2. Что такое десериализация в контексте  протокола HTTP?
                    3. За что отвечает HttpMessageConverter?
                
                Решение:\s""");

        System.out.println("""
                Ответ на вопрос 1, Что такое сериализации в контексте протокола HTTP?:
                  В HTTP существуют различные типы запросов, используемые для взаимодействия между клиентом и сервером.
                  Некоторые из известных типов запросов в HTTP:
                  - GET - запрос для получения данных с сервера.
                
                  \s""");
    }
}