package task10_1_1;

// В этом фрагменте, Draft_Module11_Task1_Zadaniya1-5, приступил к Модулю 11

public class Task10_1_1 {

    public static void main(String[] args) {
        System.out.println("""
                Задание:\s
                Модуль 11. Протокол “HTTP”. Задание №1:\s
                    1. Расскажите, как вы поняли, что такое HTTP?
                    2. Какие возможные сценарии использования протокола HTTP?
                    3. Опишите методы  HTTP
                    4. Что такое URL?
                    5. Какие еще сетевые протоколы вам известны?

                Решение:\s""");

    }
}