package task12_2_1.zadanye1;

public class Zadanye1 {
    public static void main(String[] args) {
        System.out.println("""
            Задание:\s
            Модуль 12. Базы данных и Git. Задание №2:\s
            Цель задания: знакомство и формирование базовых навыков с по работе  с SQLite\s
                Задание:
                1. Что такое SQLite?
            
            Решение:
            \s""");

        System.out.println("""
            SQLite - это компактная и легковесная реляционная база данных, которая предоставляет возможность
            хранить и управлять данными в локальном файле. SQLite не требует установки отдельного сервера базы
            данных и поддерживает основные операции SQL. Он широко используется в мобильной разработке, веб-разработке
            и других областях программирования, где требуется легковесная база данных.\s""");
    }
}