package task11_3_1;

// В этом фрагменте, Draft_Module11_Task3_Zadaniya1-2,

public class Task11_3_1 {
    public static void main(String[] args) {
        System.out.println("""
                Задание:\s
                Модуль 11. Протокол “HTTP”. Задание №3:\s
                Цель задания: познакомиться с видами запросов в HTTP
                    Задание:
                    1. Какие запросы в HTTP вы знаете ?\s
                    2. Приведите пример любого HTTP запроса?
                
                Решение:\s""");

        System.out.println("""
                Ответ по заданию 1, Ознакомьтесь с информацией о заголовках HTTP https://developer.mozilla.org/ru/docs/Web/HTTP/Headers:
                  - Ознакомился с информацией на указанной веб-страице. В частности, ознакомился с определением: что такое "Заголовки HTTP".
                  Заголовки HTTP позволяют клиенту и серверу отправлять дополнительную информацию с HTTP запросом или ответом.
                
                Ответ на вопрос 2, О каких видах заголовках в HTTP   вы узнали?:
                  Существуют следующие виды заголовков HTTP:
                  - Основные заголовки;
                  \s""");
    }
}